---
kind: property
id: P:Autodesk.Revit.DB.ModelText.Subcategory
source: html/5a6ba592-c453-5658-f0c6-1ec34052b9be.htm
---
# Autodesk.Revit.DB.ModelText.Subcategory Property

The subcategory.

## Syntax (C#)
```csharp
public Category Subcategory { get; set; }
```

## Remarks
The subcategory can be set to either the family category or one of its subcategories.